mamedev/mame/src/devices/cpu/tms320c2x/tms320c2x.cpp
/*
   Processor can be operated in one of two modes based on Pin 1 (MP/MC)
   MP/MC = 1 (Microprocessor Mode)
   MP/MC = 0 (Microcomputer Mode)
   in 'Microcomputer' mode the 4K Word internal ROM is used (TMS320C25)

   use set_mp_mc in the device configuration to set the pin for internal ROM mode
*/
DEFINE_DEVICE_TYPE(TMS32020,  tms32020_device,  "tms32020",  "Texas Instruments TMS32020")
DEFINE_DEVICE_TYPE(TMS320C25, tms320c25_device, "tms320c25", "Texas Instruments TMS320C25")
DEFINE_DEVICE_TYPE(TMS320C26, tms320c26_device, "tms320c26", "Texas Instruments TMS320C26")

void tms320c2x_device::tms320c2x_data(address_map &map)
{
	map(0x0000, 0x0000).rw(FUNC(tms320c2x_device::drr_r), FUNC(tms320c2x_device::drr_w));
	map(0x0001, 0x0001).rw(FUNC(tms320c2x_device::dxr_r), FUNC(tms320c2x_device::dxr_w));
	map(0x0002, 0x0002).rw(FUNC(tms320c2x_device::tim_r), FUNC(tms320c2x_device::tim_w));
	map(0x0003, 0x0003).rw(FUNC(tms320c2x_device::prd_r), FUNC(tms320c2x_device::prd_w));
	map(0x0004, 0x0004).rw(FUNC(tms320c2x_device::imr_r), FUNC(tms320c2x_device::imr_w));
	map(0x0005, 0x0005).rw(FUNC(tms320c2x_device::greg_r), FUNC(tms320c2x_device::greg_w));
	map(0x0060, 0x007f).ram().share("b2");
	map(0x0200, 0x02ff).ram().share("b0");
	map(0x0300, 0x03ff).ram().share("b1");
}

void tms320c2x_device::tms320c26_data(address_map &map)
{
	map(0x0000, 0x0000).rw(FUNC(tms320c2x_device::drr_r), FUNC(tms320c2x_device::drr_w));
	map(0x0001, 0x0001).rw(FUNC(tms320c2x_device::dxr_r), FUNC(tms320c2x_device::dxr_w));
	map(0x0002, 0x0002).rw(FUNC(tms320c2x_device::tim_r), FUNC(tms320c2x_device::tim_w));
	map(0x0003, 0x0003).rw(FUNC(tms320c2x_device::prd_r), FUNC(tms320c2x_device::prd_w));
	map(0x0004, 0x0004).rw(FUNC(tms320c2x_device::imr_r), FUNC(tms320c2x_device::imr_w));
	map(0x0005, 0x0005).rw(FUNC(tms320c2x_device::greg_r), FUNC(tms320c2x_device::greg_w));
	map(0x0060, 0x007f).ram().share("b2");
	map(0x0200, 0x03ff).ram().share("b0");
	map(0x0400, 0x05ff).ram().share("b1");
	map(0x0600, 0x07ff).ram().share("b3");
}

#if 0
// Instead of using the map here we install the ROM depending on the MP/MC pin set in the config
void tms320c2x_device::tms320c25_program(address_map &map)
{
	map(0x0000, 0x0fff).rom().region("internal", 0); // 4K Words Internal ROM / EPROM
}
#endif

ROM_START( tms320c25 )
	ROM_REGION16_BE( 0x2000, "internal", ROMREGION_ERASE00 )
	// use blank data if internal ROM is not programmed
ROM_END

const tiny_rom_entry *tms320c25_device::device_rom_region() const
{
	return ROM_NAME(tms320c25);
}


tms320c2x_device::tms320c2x_device(
		const machine_config &mconfig,
		device_type type,
		const char *tag,
		device_t *owner,
		uint32_t clock,
		unsigned stack_depth,
		address_map_constructor prgmap,
		address_map_constructor datamap)
	: cpu_device(mconfig, type, tag, owner, clock)
	, m_program_config("program", ENDIANNESS_BIG, 16, 16, -1, prgmap)
	, m_data_config("data", ENDIANNESS_BIG, 16, 16, -1, datamap)
	, m_io_config("io", ENDIANNESS_BIG, 16, 16, -1)
	, m_b0(*this, "b0")
	, m_b1(*this, "b1")
	, m_b2(*this, "b2")
	, m_b3(*this, "b3")
	, m_bio_in(*this, 0xffff)
	, m_hold_in(*this, 0xffff)
	, m_hold_ack_out(*this)
	, m_xf_out(*this)
	, m_dr_in(*this, 0xffff)
	, m_dx_out(*this)
	, m_stack_limit(stack_depth - 1)
{
}

tms32020_device::tms32020_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms320c2x_device(mconfig, TMS32020, tag, owner, clock, 4, address_map_constructor(), address_map_constructor(FUNC(tms320c2x_device::tms320c2x_data), this))
{
	m_fixed_STR1 = 0x0180;
}

tms320c25_device::tms320c25_device(const machine_config &mconfig, device_type type, const char *tag, device_t *owner, uint32_t clock, address_map_constructor prgmap, address_map_constructor datamap)
	: tms320c2x_device(mconfig, type, tag, owner, clock, 8, prgmap, datamap)
	, m_mp_mc(true)
{
}

tms320c25_device::tms320c25_device(const machine_config &mconfig, device_type type, const char *tag, device_t *owner, uint32_t clock)
	: tms320c25_device(mconfig, type, tag, owner, clock, address_map_constructor(), address_map_constructor(FUNC(tms320c2x_device::tms320c2x_data), this))
{
	m_fixed_STR1 = 0x0180;
}

tms320c25_device::tms320c25_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms320c25_device(mconfig, TMS320C25, tag, owner, clock)
{
}

tms320c26_device::tms320c26_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms320c25_device(mconfig, TMS320C26, tag, owner, clock, address_map_constructor(), address_map_constructor(FUNC(tms320c26_device::tms320c26_data), this))
{
	m_fixed_STR1 = 0x0100;
}

device_memory_interface::space_config_vector tms320c2x_device::memory_space_config() const
{
	return space_config_vector {
		std::make_pair(AS_PROGRAM, &m_program_config),
		std::make_pair(AS_DATA,    &m_data_config),
		std::make_pair(AS_IO,      &m_io_config)
	};
}

std::unique_ptr<util::disasm_interface> tms320c2x_device::create_disassembler()
{
	return std::make_unique<tms320c2x_disassembler>();
}

uint16_t tms320c2x_device::drr_r()
{
	return m_drr;
}

void tms320c2x_device::drr_w(uint16_t data)
{
	m_drr = data;
}

uint16_t tms320c2x_device::dxr_r()
{
	return m_dxr;
}

void tms320c2x_device::dxr_w(uint16_t data)
{
	m_dxr = data;

	if(TXM) {
		if(FSM)
			m_waiting_for_serial_frame = true;
		else
			m_IFR |= 0x20;
	}
}

uint16_t tms320c2x_device::tim_r()
{
	return m_tim;
}

void tms320c2x_device::tim_w(uint16_t data)
{
	m_tim = data;
}

uint16_t tms320c2x_device::prd_r()
{
	return m_prd;
}

void tms320c2x_device::prd_w(uint16_t data)
{
	m_prd = data;
}

uint16_t tms320c2x_device::imr_r()
{
	return m_imr;
}

void tms320c2x_device::imr_w(uint16_t data)
{
	m_imr = data;
}

uint16_t tms320c2x_device::greg_r()
{
	return m_greg;
}

void tms320c2x_device::greg_w(uint16_t data)
{
	m_greg = data;
}


inline void tms320c2x_device::CLR0(uint16_t flag) { m_STR0 &= ~flag; m_STR0 |= 0x0400; }
inline void tms320c2x_device::SET0(uint16_t flag) { m_STR0 |=  flag; m_STR0 |= 0x0400; }
inline void tms320c2x_device::CLR1(uint16_t flag) { m_STR1 &= ~flag; m_STR1 |= m_fixed_STR1; }
inline void tms320c2x_device::SET1(uint16_t flag) { m_STR1 |=  flag; m_STR1 |= m_fixed_STR1; }

inline void tms320c2x_device::MODIFY_DP(int data)
{
	m_STR0 &= ~DP_REG;
	m_STR0 |= (data & DP_REG);
	m_STR0 |= 0x0400;
}

inline void tms320c2x_device::MODIFY_PM(int data)
{
	m_STR1 &= ~PM_REG;
	m_STR1 |= (data & PM_REG);
	m_STR1 |= m_fixed_STR1;
}

inline void tms320c2x_device::MODIFY_ARP(int data)
{
	m_STR1 &= ~ARB_REG;
	m_STR1 |= (m_STR0 & ARP_REG);
	m_STR1 |= m_fixed_STR1;
	m_STR0 &= ~ARP_REG;
	m_STR0 |= ((data << 13) & ARP_REG);
	m_STR0 |= 0x0400;
}

uint16_t tms320c2x_device::reverse_carry_add(uint16_t arg0, uint16_t arg1)
{
	uint16_t result = 0;
	int carry = 0;
	for (int count = 0; count < 16; count++)
	{
		int sum = (arg0 >> 15) + (arg1 >> 15) + carry;
		result = (result << 1) | (sum & 1);
		carry = sum >> 1;
		arg0 <<= 1;
		arg1 <<= 1;
	}
	return result;
}

